In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("1.csv")

In [3]:
data.head()

  Customer ID  Purchase Amount Date of purchase  Category
0           A              100       2022 01 02      Food
1           B               50       2022 01 01  Medicine
2           C               20       2022 01 03   General
3           D               40       2022 01 02      Food
4           E               90       2022 01 05   General

In [4]:
data

  Customer ID  Purchase Amount Date of purchase  Category
0           A              100       2022 01 02      Food
1           B               50       2022 01 01  Medicine
2           C               20       2022 01 03   General
3           D               40       2022 01 02      Food
4           E               90       2022 01 05   General
5           F               40       2022 01 08   General

In [5]:
data.describe()

       Purchase Amount
count         6.000000
mean         56.666667
std          31.411251
min          20.000000
25%          40.000000
50%          45.000000
75%          80.000000
max         100.000000

In [6]:
missing_values=data.isnull().sum()
missing_values

Customer ID         0
Purchase Amount     0
Date of purchase    0
Category            0
dtype: int64

In [7]:
data.shape

(6, 4)

In [8]:
variable_types = data.dtypes
print(variable_types)

Customer ID         object
Purchase Amount      int64
Date of purchase    object
Category            object
dtype: object

In [9]:
data['Purchase Amount'] = data['Purchase Amount'].astype(str)

In [10]:
data.dtypes

Customer ID         object
Purchase Amount     object
Date of purchase    object
Category            object
dtype: object

In [11]:
data['Purchase Amount'] = pd.to_numeric(data['Purchase Amount'])

In [12]:
data.dtypes

Customer ID         object
Purchase Amount      int64
Date of purchase    object
Category            object
dtype: object

In [13]:
from sklearn.preprocessing import LabelEncoder

In [14]:
labelencoder=LabelEncoder()

In [15]:
data['Customer ID']=labelencoder.fit_transform(data['Customer ID'])

In [16]:
data.head()

   Customer ID  Purchase Amount Date of purchase  Category
0            0              100       2022 01 02      Food
1            1               50       2022 01 01  Medicine
2            2               20       2022 01 03   General
3            3               40       2022 01 02      Food
4            4               90       2022 01 05   General

In [28]:
from sklearn.preprocessing import OneHotEncoder

In [30]:
onehot_encoder = OneHotEncoder(sparse=False)

In [31]:
category_2d = np.array(data['Category']).reshape(-1, 1)

In [32]:
category_2d

array([['Food'],
       ['Medicine'],
       ['General'],
       ['Food'],
       ['General'],
       ['General']], dtype=object)

In [35]:
encoded_category = onehot_encoder.fit_transform(category_2d)

In [36]:
encoded_category

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 1., 0.]])

In [45]:
encoded_column_names = onehot_encoder.get_feature_names(['Category'])

In [46]:
encoded_column_names

array(['Category_Food', 'Category_General', 'Category_Medicine'],
      dtype=object)

In [38]:
encoded_df = pd.DataFrame(encoded_category, columns=encoded_column_names)

In [42]:
encoded_df

   Category_Food  Category_General  Category_Medicine
0            1.0               0.0                0.0
1            0.0               0.0                1.0
2            0.0               1.0                0.0
3            1.0               0.0                0.0
4            0.0               1.0                0.0
5            0.0               1.0                0.0

In [39]:
data_encoded = pd.concat([data, encoded_df], axis=1)

In [40]:
data_encoded

,Customer ID,Purchase Amount,Date of purchase,Category,Category_Food,Category_General,Category_Medicine
0,0,100,2022 01 02,Food,1.0,0.0,0.0
1,1,50,2022 01 01,Medicine,0.0,0.0,1.0
2,2,20,2022 01 03,General,0.0,1.0,0.0
3,3,40,2022 01 02,Food,1.0,0.0,0.0
4,4,90,2022 01 05,General,0.0,1.0,0.0
5,5,40,2022 01 08,General,0.0,1.0,0.0